Revit 2026 API

# GradientNoiseType Enumeration

---

The enumerated type representing the permitted values for the asset property "GradientNoise" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum GradientNoiseType
```
```vb
Public Enumeration GradientNoiseType
```
```cpp
public enum class GradientNoiseType
```
```fsharp
type GradientNoiseType
```

| Member name | Value | Description |
| --- | --- | --- |
| Fractal | 2 |  |
| Regular | 0 |  |
| Turbulence | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace